"""
Сюжет:
Друг Алона, скептически хмурясь, не верит, что элементы списка способны появиться на экране,
словно по волшебству, с помощью единственного вызова print().
Однако Алон, словно просветлённый йогин, обладающий тайными знаниями, уверенно готов доказать обратное.
Он знает, что в мире программирования есть циклы, похожие на колесо Сансары.

Задание:
Уже создана переменная list_in, которая является списком (см. Sample Input).
Количество элементов в списке может быть разным.
Ваша задача, вывести на экран каждый элемент списка list_in на отдельной строке (см. Sample Output).
В вашем коде, слово print должно встречаться только один раз.
"""

list_in = ["Алон", "Дама Ван", "Жанна Клодий"]
for i in list_in:
    print(i)
