"""
Сюжет:
В мире, где разобщённость стала обыденностью, Алон, словно герой на поле битвы, придерживается теории объединения.
Работая над школьной программой, Алон решает воплотить свои убеждения в коде и объединить два кортежа.
Алон знает как это можно сделать и словно открывая лёгкий замок в игре Fallout 4, использует знания о кортежах.
Это не просто код – это его манифест единства, и Алон знает, что это шаг навстречу гармонии.

Задание:
Уже созданы две переменные t1 и t2, которые являются кортежами со школьными предметами (см. Sample Input).
Создайте новый кортеж состоящий из элементов двух кортежей t1 и t2.
Новый кортеж будет начинаться с элементов первого кортежа и заканчиваться элементами второго (см. Sample Output).
Выведите на экран новый кортеж.
Задание изменено 21.10.2024
"""
t1 = ('Математика', 'История', 'Информатика')
t2 = ('Геометрия', 'Физика', 'Химия')
print(t1 + t2)
