"""
Сюжет:
Алон раскрыл тайну древней загадки, скрывавшейся во мраке веков.
Чтобы разгадать загадку, нужно взять первые буквы каждого слова,
убрать из них дубликаты и разместить получившиеся буквы по возрастанию.
Алон сумел достичь этого с помощью кода.
А вы готовы принять вызов и повторить его успех?

Задание:
В программу поступает строка (загадка) состоящая из слов (см. Sample Input), например:
истинные мысли и ясность являют мудрость

Если взять все первые буквы каждого слова, то получится:

имияям


Теперь, убираем дубликаты букв и размещаем уникальные буквы в порядке возрастания, как в алфавите.
Получится: имя

Создайте программу, которая расшифрует поступающую строку и выведет разгадку на экран.
Примеры разгадки смотрите в Sample Output.
Помните, что множества создают коллекции из уникальных объектов, но эти коллекции не имеют порядка.
"""
